{
  "sections": {
    "main": {
      "type": "main-page",
      "settings": {
      }
    },
    "162766114274f75b3f": {
      "type": "image",
      "settings": {
        "image": "shopify:\/\/shop_images\/italian-farm-buildings.jpg"
      }
    },
    "rich-text": {
      "type": "rich-text",
      "blocks": {
        "text": {
          "type": "text",
          "settings": {
            "text": "<p>Johan Hentze established the family farm in the South Willamette Valley (Junction City) in 1902.There have been a few different paths the family has chosen over the past century, dairy, grass seed, etc.Right now we focus on our orchard work, our farmstand and our small barn factory which has one of the only cherry pitters in the county. We also have a corn cutter and a bean snipper. Home canners have come to rely on us for their bags of cut corn and washed, snipped and cut green beans to stock their pantry for the winter.<\/p><p><br\/>We also have a bit of agro-tourism here. We've done the pumpkin patch, with tractor rides, for years. And, weather permitting, we'll do a \"Night Walk\". Kind of a \"haunted pasture\". This features hundreds of carved pumpkin Jack O' Lanterns (Yes, we would love for you to volunteer to carve!!). This led to folks inquiring about hot cocoa and snacks, etc.<\/p><p><br\/>Almost 15 years ago we constructed a food trailer for concessions and parked it on our lawn near a canopy of 100 year old walnut trees. So we hold a few events and farm dinners every year. Easter Egg Hunt, Annual Cherry Festival, and an Oktoberfest. We try and schedule a few farm dinners sprinkled throughout. Always leaning on our amazing sister farms here in the Valley.<br\/><br\/>That, in turn, has opened the door for event hosting. This will be our first year of hosting wedding on our farm. Well, wedding outside the extended family<\/p>"
          }
        }
      },
      "block_order": [
        "text"
      ],
      "settings": {
      }
    },
    "1627704843ea7b4b94": {
      "type": "farming-practices",
      "settings": {
        "certified_organic": true,
        "cover_crops": true,
        "crop_rotation": true,
        "integrated_crops_and_livestock": true,
        "integrated_pest_management": true,
        "no_till_reduced_till": true
      }
    }
  },
  "order": [
    "main",
    "162766114274f75b3f",
    "rich-text",
    "1627704843ea7b4b94"
  ]
}
